In [1]:
import pandas as pd

In [3]:
friend_dict_list=[
    {"name":"john",
    "age":25,
    "job":"student"},
    {"name":"Nate",
    "age":25,
    "job":"teacher"},
    {"name":"jenny",
    "age":25,
    "job":"developer"},
    
]

friend_df=pd.DataFrame(friend_dict_list)
friend_df

    name  age        job
0   john   25    student
1   Nate   25    teacher
2  jenny   25  developer

In [5]:
score_dict={"국어":[15,25,35],"영어":[45,55,65],"수학":[75,85,95]}
score_df=pd.DataFrame(score_dict)
score_df

   국어  영어  수학
0  15  45  75
1  25  55  85
2  35  65  95

In [7]:
person_df=pd.DataFrame(friend_dict_list,index=["f1","f2","f3"])
person_df

     name  age        job
f1   john   25    student
f2   Nate   25    teacher
f3  jenny   25  developer

In [9]:
month_df=pd.DataFrame(score_dict,index=["1월","2월","3월"])
month_df

    국어  영어  수학
1월  15  45  75
2월  25  55  85
3월  35  65  95

In [10]:
list=[[1,2,3,4,5],[6,7,8,9,19]]

two_df=pd.DataFrame(list,index=["내용1","내용2"],columns=["c1","c2","c3","c4","c5"])

In [11]:
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  19

In [24]:
temp=open("./data/sample1.csv","r",encoding="utf-8")
print(type(temp.read()) )
temp2=temp.read()

<class 'str'>

In [27]:
df=pd.read_csv("./data/sample1.csv",header=None , names=["c1","c2","c3"])
df

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18

In [38]:
df=pd.read_csv("./data/sample2.csv" ,delimiter="|",index_col="번호")
df

     이름                 가입일시  나이
번호
1   김정수  2017-01-19 11:30:00  25
2   박민구  2017-02-07 10:22:00  35
3   정순미  2017-01-22 09:10:00  33
4   김정현  2017-02-22 14:09:00  45
5   홍미진  2017-04-01 18:00:00  17
6   김순철  2017-05-14 22:33:07  22
7   이동철  2017-03-01 23:44:45  27
8   박지숙  2017-01-11 06:04:18  30
9   김은미  2017-02-08 07:44:33  51
10  장혁철  2017-12-01 13:01:11  16

In [39]:
excel_df=pd.read_excel("./data/train.xlsx")
excel_df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [40]:
sample_df =pd.read_excel("./data/sample.xlsx")
sample_df

   Sap Co.        대리점 영업사원       전월       금월  TEAM  총 판매수량
0   KI1316    경기수원대리점  이기정  1720000  2952000     1     123
1   KI1451    충청홍성대리점  정미진  4080000  2706000     2     220
2   KI1534    경기화성대리점  경인선   600000  2214000     1     320
3   KI1636    강원속초대리점  이동권  3720000  2870000     3     110
4   KI1735    경기안양대리점  강준석  4800000  2296000     1     134
5   KI1875   제주제주시대리점  민경수  3420000  2346000     4     210
6   KI1917    경기광주대리점  김진혜  1292000  1518000     1     110
7   KI2032    경기평택대리점  고유정  2736000  2139000     2      90
8   KI2153   경기의정부대리점  김은향  1368000  2484000     1     183
9   KI2214    경기성남대리점  이준수  1976000  1518000     3      73
10  KI2313  제주서귀포시대리점  온지수   152000   945000     1      52
11  KI2433    경기계양대리점  이희영  1833000  1404000     1     110
12  KI2512    경기평촌대리점  강백호  4320000  2312000     3     240
13  KI2671  제주서귀포시대리점  주은명  4040000  4760000     4      50
14  KI2776   경기남양주대리점  김수진  8160000  4352000     2     354
15  KI2870   경기구리시대리점  박진형  6000000  3400000     2     143
16  KI2910    강원춘천대리점  김은향  4800000  4896000     1     176
17  KI3030    강원영동대리점  전수창  4560000  3128000     2      98
18  KI3131    경기하남대리점  김민정  2750000  7268000     3     293
19  KI3252    강원포천대리점  서가은  2420000  4740000     4     240

In [48]:
friend_df[1:3]

    name  age        job
1   Nate   25    teacher
2  jenny   25  developer

In [49]:
friend_df["name"]

0     john
1     Nate
2    jenny
Name: name, dtype: object